/*********************************************/
/* N×N 行列の転置行列算出プログラムの例 */
/*********************************************/
#include <stdio.h>
#define N 5
int main(void) {
    int i, j;
    double p;
    double a[N][N] = {{1.0, 2.0, 3.0, 4.0, 5.0},
                      {6.0, 7.0, 8.0, 9.0, 0.0},
                      {1.0, 2.0, 3.0, 4.0, 5.0},
                      {6.0, 7.0, 8.0, 9.0, 0.0},
                      {1.0, 2.0, 3.0, 4.0, 5.0}};
    printf("\n\n---行列 A の表示---");
    for (i = 0; i <= N - 1; i++) {
        printf("\n");
        for (j = 0; j <= N - 1; j++) {
            printf("%3.1lf,", a[i][j]);
        }
    }
    for (i = 0; i <= N - 2; i++) {
        for (j = i + 1; j <= N - 1; j++) {
            p = a[i][j];
            a[i][j] = a[j][i];
            a[j][i] = p;
        }
    }
    printf("\n\n---行列 A の転置行列の表示---");
    for (i = 0; i <= N - 1; i++) {
        printf("\n");
        for (j = 0; j <= N - 1; j++) {
            printf("%3.1lf,", a[i][j]);
        }
    }
    printf("\n\n");
    return 0;
}
